---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NoInputNode
source: html/9d63b356-60a3-23aa-fd83-4578fc426455.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NoInputNode Property

The calculation could not be executed as configured. Select an input node before analyzing this network.

## Syntax (C#)
```csharp
public static FailureDefinitionId Network_NoInputNode { get; }
```